{"ABL1": {"Variant": "ETV6 - ABL1", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "ETV6-ABL1 results from the fusion of ETV6 (also referred to as TEL) and ABL1, demonstrating increased kinase activity (PMID: 9695962) and the ability to induce CML-like myeloproliferative disease in mice (PMID: 12036890) and in cell culture (PMID: 9695962).", "Associated with drug Resistance": ""}, "AKT1": {"Variant": "R370C", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "AKT1 R370C lies within the protein kinase domain of the Akt1 protein (UniProt.org). R370C has not been biochemically characterized, however, the effect on Akt1 protein function is conflicting, as it induces tumor formation in xenograft models (PMID: 27147599), but in another assay was is not transforming in cultured cells (PMID: 26701849).", "Associated with drug Resistance": ""}, "ALK": {"Variant": "EML4 - ALK", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "EML4-ALK results from the fusion of EML4 and ALK, resulting in constitutive kinase activity, transformation in cultured cells, and tumor activity in mouse models (PMID: 19064915, PMID: 17625570). EML4-ALK fusions have been associated with non-small cell lung cancer (PMID: 26755435).", "Associated with drug Resistance": ""}, "APC": {"Variant": "C1274fs", "Imapct": "frameshift", "Protein Effect": "loss of function - predicted", "Variant Description": "APC C1274fs results in a change in the amino acid sequence of the Apc protein beginning at aa 1274 of 2843, likely resulting in premature truncation of the functional protein (UniProt.org). C1274fs has not been characterized, however, due to the effects of an Apc truncation at I1572 (PMID: 10346819), C1274fs is predicted to reduce the ability of Apc to regulate beta-catenin.", "Associated with drug Resistance": ""}, "ARID1A": {"Variant": "S2104F", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "ARID1A S2104F lies within the GR binding domain of the Arid1a protein (PMID: 23208470). S2104F has not been characterized in the scientific literature and therefore, its effect on Arid1a protein function is unknown (PubMed, Jul 2019).", "Associated with drug Resistance": ""}, "ASXL1": {"Variant": "K163T", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "ASXL1 K163T lies within the nuclear localization signal motif 1 of the Asxl1 protein (UniProt.org). K163T has not been characterized in the scientific literature and therefore, its effect on Asxl1 protein function is unknown (PubMed, Sep 2019).", "Associated with drug Resistance": ""}, "ATM": {"Variant": "Y1124F", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "ATM Y1124F does not lie within any known functional domains of the Atm protein (UniProt.org). Y1124F has been identified in sequencing studies (PMID: 28779002), but has not been biochemically characterized and therefore, its effect on Atm protein function is unknown (PubMed, Aug 2019).", "Associated with drug Resistance": ""}, "ATRX": {"Variant": "F2102C", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "ATRX F2102C lies within the helicase C-terminal domain of the Atrx protein (UniProt.org). F2102C has not been characterized in the scientific literature and therefore, its effect on Atrx protein function is unknown (PubMed, Jul 2019).", "Associated with drug Resistance": ""}, "BCOR": {"Variant": "P1451L", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "BCOR P1451L does not lie within any known functional domains of the Bcor protein (UniProt.org). P1451L has not been characterized in the scientific literature and therefore, its effect on Bcor protein function is unknown (PubMed, Sep 2019).", "Associated with drug Resistance": ""}, "BCORL1": {"Variant": "K1207N", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "BCORL1 K1207N does not lie within any known functional domains of the Bcorl1 protein (UniProt.org). K1207N has not been characterized in the scientific literature and therefore, its effect on Bcorl1 protein function is unknown (PubMed, Mar 2018).", "Associated with drug Resistance": ""}, "BRAF": {"Variant": "V600E/K", "Imapct": "missense", "Protein Effect": "gain of function", "Variant Description": "BRAF V600E/K indicates a mutation that results in the replacement of the valine (V) at amino acid 600 of the Braf protein by either a glutamate (E) or lysine (K). V600E/K mutations are hotspot mutations in Braf that result in increased Braf kinase activity (PMID: 15035987).", "Associated with drug Resistance": ""}, "CALR": {"Variant": "S300Y", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "CALR S300Y lies within the P-domain region of the Calr protein (UniProt.org). S300Y has been identified in the scientific literature (PMID: 29218307), but has not been biochemically characterized and therefore, its effect on Calr protein function is unknown (PubMed, Jul 2019).", "Associated with drug Resistance": ""}, "CBL": {"Variant": "Y371H", "Imapct": "missense", "Protein Effect": "loss of function", "Variant Description": "CBL Y371H lies within the linker region of the Cbl protein (PMID: 20622007). Y371H results in a loss of Cbl ubiquitin ligase activity, leading to activation of FLT3, AKT, and STAT5, and transformation of cultured cells when co-expressed with FLT3 or KIT (PMID: 23696637, PMID: 20622007).", "Associated with drug Resistance": ""}, "CBLB": {"Variant": "I619M", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "CBLB I619M does not lie within any known functional domains of the Cblb protein (UniProt.org). I619M has not been characterized in the scientific literature and therefore, its effect on Cblb protein function is unknown (PubMed, Sep 2018).", "Associated with drug Resistance": ""}, "CBLC": {"Variant": "V213L", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "CBLC V213L lies within the Cbl-PTB domain of the Cblc protein (UniProt.org). V213L has not been characterized and therefore, its effect on Cblc protein function is unknown (PubMed, Jul 2019).", "Associated with drug Resistance": ""}, "CDH1": {"Variant": "D858E", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "CDH1 D858E lies within the catenin-binding region of the Cdh1 protein (UniProt.org). D858E has been identified in sequencing studies (PMID: 21798893), but has not been characterized and therefore, its effect on Cdh1 protein function is unknown (PubMed, Sep 2018).", "Associated with drug Resistance": ""}, "CDKN2A": {"Variant": "A102fs", "Imapct": "frameshift", "Protein Effect": "loss of function - predicted", "Variant Description": "CDKN2A A102fs results in a change in the amino acid sequence of the Cdkn2a protein beginning at aa 102 of 156, likely resulting in premature truncation of the functional protein (UniProt). A102fs has not been characterized, however, nonsense mutations downstream of A102 are inactivating (PMID: 9053859, PMID: 8668202), thus A102fs is predicted to lead to a loss of Cdkn2a protein function.", "Associated with drug Resistance": ""}, "CEBPA": {"Variant": "T337M", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "CEBPA T337M lies within the bZIP domain of the Cebpa protein (UniProt.org). T337M has been identified in sequencing studies (PMID: 24755471), but has not been biochemically characterized and therefore, its effect on Cebpa protein function is unknown (PubMed, Oct 2019).", "Associated with drug Resistance": ""}, "CSF1R": {"Variant": "L301S", "Imapct": "missense", "Protein Effect": "gain of function", "Variant Description": "CSF1R L301S lies within the Ig-like C2-type domain 4 of the Csf1r protein (UniProt.org). L301S results in a gain of function in Csf1r, demonstrating constitutive kinase activity, transforming activity in cultured cells (PMID: 2157180), and tumorigenicity in nude mice (PMID: 2974321).", "Associated with drug Resistance": ""}, "CSF3R": {"Variant": "D40N", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "CSF3R D40N lies within the Ig-like C2-type domain of the Csf3r protein (UniProt.org). D40N has not been characterized in the scientific literature and therefore, its effect on Csf3r protein function is unknown (PubMed, Jul 2019).", "Associated with drug Resistance": ""}, "CTNNB1": {"Variant": "S33N", "Imapct": "missense", "Protein Effect": "gain of function - predicted", "Variant Description": "CTNNB1 S33N lies within the ubiquitination recognition motif of the Ctnnb1 protein and occurs at a Gsk3b phosphorylation site on the Ctnnb1 protein (PMID: 15064718). S33N is predicted to confer a gain of function to the Ctnnb1 protein as demonstrated by nuclear accumulation of Ctnnb1 (PMID: 11276007).", "Associated with drug Resistance": ""}, "DDR2": {"Variant": "T713I", "Imapct": "missense", "Protein Effect": "loss of function", "Variant Description": "DDR2 T713I lies within the protein kinase domain of the Ddr2 protein (UniProt.org). T713I results in aberrant Ddr2 localization and decreased collagen-induced Ddr2 phosphorylation in culture (PMID: 20223752).", "Associated with drug Resistance": ""}, "DNMT3A": {"Variant": "P718L", "Imapct": "missense", "Protein Effect": "loss of function", "Variant Description": "DNMT3A P718L lies within the SAM-dependent MTase C5-type domain of the Dnmt3a protein (UniProt.org). P718L results in reduced Dnmt3A enzymatic activity and decreased DNA methylation at commonly demethylated sites, and cytokine-independent growth in cell culture (PMID: 29414941).", "Associated with drug Resistance": ""}, "EGFR": {"Variant": "T354K", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "EGFR T354K lies within the extracellular domain of the Egfr protein (UniProt.org). T354K has been identified in sequencing studies (J Clin Oncol 37, 2019 (suppl; abstr e13000)), but has not been biochemically characterized and therefore, its effect on Egfr protein function is unknown (PubMed, Jun 2019).", "Associated with drug Resistance": ""}, "EML4": {"Variant": "EML4 - ALK", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "EML4-ALK results from the fusion of EML4 and ALK, resulting in constitutive kinase activity, transformation in cultured cells, and tumor activity in mouse models (PMID: 19064915, PMID: 17625570). EML4-ALK fusions have been associated with non-small cell lung cancer (PMID: 26755435).", "Associated with drug Resistance": ""}, "ERBB2": {"Variant": "G776_V777insVGC", "Imapct": "insertion", "Protein Effect": "gain of function - predicted", "Variant Description": "ERBB2 (HER2) G776_V777insVGC results in the insertion of three amino acids in the protein kinase domain of the Erbb2 (Her2) protein between amino acids 776 and 777 (UniProt.org). G776_V777insVGC has not been characterized, however other exon 20 insertions are activating thus, G776_V777insVGC is predicted to lead to gain of Erbb2 (Her2) function (PMID: 16843263, PMID: 17311002, PMID: 23220880).", "Associated with drug Resistance": ""}, "ERBB4": {"Variant": "N1044D", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "ERBB4 N1044D lies within the cytoplasmic domain of the Erbb4 protein (UniProt.org). N1044D has not been characterized in the scientific literature and therefore, its effect on Erbb4 protein function is unknown (PubMed, Jun 2019).", "Associated with drug Resistance": ""}, "ETV6": {"Variant": "ETV6 - FGFR3", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "ETV6-FGFR3 results from the fusion of ETV6 (also referred to as TEL) and FGFR3 (PMID: 15514005), demonstrating constitutive kinase activity and the ability to transform cells in culture (PMID: 15514005).", "Associated with drug Resistance": ""}, "EZH2": {"Variant": "Y111D", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "EZH2 Y111D lies within the D1 domain of the Ezh2 protein (PMID: 26360609). Y111D has been demonstrated as to occur as a secondary mutation that confers resistance to Ezh2 inhibitors (PMID: 30555699, PMID: 26360609), but has not been biochemically characterized and therefore, its effect on Ezh2 protein function is unknown (PubMed, Oct 2019).", "Associated with drug Resistance": "Y"}, "FBXW7": {"Variant": "V464M", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "FBXW7 V464M lies within WD repeat 3 of the Fbxw7 protein (UniProt.org). V464M has been identified in sequencing studies (PMID: 28424412), but has not been biochemically characterized and therefore, its effect on Fbxw7 protein function is unknown (PubMed, Nov 2019).", "Associated with drug Resistance": ""}, "FGFR1": {"Variant": "EGFR - FGFR1", "Imapct": "fusion", "Protein Effect": "unknown", "Variant Description": "EGFR-FGFR1 results from the fusion of EGFR and FGFR1 (PMID: 29883838). EGFR-FGFR1 has been identified in non-small cell lung cancer (PMID: 29883838), but has not been biochemically characterized and therefore, the effect on protein function is unknown (PubMed, Oct 2019).", "Associated with drug Resistance": ""}, "FGFR2": {"Variant": "fusion", "Imapct": "fusion", "Protein Effect": "unknown", "Variant Description": "FGFR2 fusion indicates a fusion of the FGFR2 gene, but the fusion partner is unknown.", "Associated with drug Resistance": ""}, "FGFR3": {"Variant": "ETV6 - FGFR3", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "ETV6-FGFR3 results from the fusion of ETV6 (also referred to as TEL) and FGFR3 (PMID: 15514005), demonstrating constitutive kinase activity and the ability to transform cells in culture (PMID: 15514005).", "Associated with drug Resistance": ""}, "FLT3": {"Variant": "ETV6 - FLT3", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "ETV6-FLT3 results from the fusion of ETV6 and FLT3, demonstrating the ability to transform cells in culture (PMID: 16761019) and has constitutively activated kinase activity (PMID: 19345670).", "Associated with drug Resistance": ""}, "FOXL2": {"Variant": "L108P", "Imapct": "missense", "Protein Effect": "loss of function - predicted", "Variant Description": "FOXL2 L108P lies within the DNA-binding region of the Foxl2 protein (UniProt.org). L108P results in impaired transactivation capacity of Foxl2 protein in culture in one study (PMID: 19515849) and therefore, is predicted to lead to a loss of Foxl2 protein function.", "Associated with drug Resistance": ""}, "GATA1": {"Variant": "S116C", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "GATA1 S116C does lie within any known functional domains of the Gata1 protein (UniProt.org). S116C has not been characterized in the scientific literature and therefore, its effect on Gata1 protein function is unknown (PubMed, Aug 2018).", "Associated with drug Resistance": ""}, "GATA2": {"Variant": "R398Q", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "GATA2 R398Q does not lie within any known functional domains of the Gata2 protein (UniProt.org). R398Q has been identified in the scientific literature (PMID: 24345756) but has not been biochemically characterized and therefore, its effect on Gata2 protein function is unknown (PubMed, Sep 2018).", "Associated with drug Resistance": ""}, "GNA11": {"Variant": "S130Vfs*32", "Imapct": "frameshift", "Protein Effect": "loss of function - predicted", "Variant Description": "GNA11 S130Vfs*32 indicates a shift in the reading frame starting at amino acid 130 and terminating 32 residues downstream causing a premature truncation of the 359 amino acid Gna11 protein (UniProt.org). Due to the loss of the majority of the GTP binding regions (UniProt.org), S130Vfs*32 is predicted to lead to a loss of Gna11 protein function.", "Associated with drug Resistance": ""}, "GNAQ": {"Variant": "E212_R213insERC", "Imapct": "insertion", "Protein Effect": "unknown", "Variant Description": "GNAQ E212_R213insERC results in the insertion of three amino acids in the G-alpha domain of the Gnaq protein between amino acids 212 and 213 (UniProt.org). E212_R213insERC has not been characterized in the scientific literature and therefore, its effect on Gnaq protein function is unknown (PubMed, Sep 2019).", "Associated with drug Resistance": ""}, "GNAS": {"Variant": "Q227L", "Imapct": "missense", "Protein Effect": "loss of function", "Variant Description": "GNAS Q227L (corresponding to Q870L in isoform XLas-1) lies within a GTP binding region of the Gnas protein (UniProt.org). Q227L results in a loss of GNAS GTPase activity, resulting in increased cAMP and activation of downstream transcription in cell culture (PMID: 8077218, PMID: 2549065).", "Associated with drug Resistance": ""}, "HNF1A": {"Variant": "T539A", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "HNF1A T539A does not lie within any known functional domains of the Hnf1a protein (UniProt.org). T539A has not been characterized in the scientific literature and therefore, its effect on Hnf1a protein function is unknown (PubMed, Sep 2018).", "Associated with drug Resistance": ""}, "HRAS": {"Variant": "G12C", "Imapct": "missense", "Protein Effect": "loss of function", "Variant Description": "HRAS G12C is hotspot mutation that lies within the GTP binding domain of the Hras protein (UniProt.org). G12C results in decreased Hras GTPase activity, loss of sensitivity to GTPase-activating proteins, thus leads to transformation of cells in culture (PMID: 24224811, PMID: 6092966).", "Associated with drug Resistance": ""}, "IDH1": {"Variant": "M291I", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "IDH1 M291I does not lie within any known functional domains of the Idh1 protein (UniProt.org). M291I has been identified in sequencing studies (PMID: 27147599), but has not been biochemically characterized and therefore, its effect on Idh1 protein function is unknown (PubMed, Sep 2019).", "Associated with drug Resistance": ""}, "IDH2": {"Variant": "G171D", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "IDH2 G171D does not lie within any known functional domains of the Idh2 protein (UniProt.org). G171D has been identified in sequencing studies (PMID: 21356389), but has not been biochemically characterized and therefore, its effect on Idh2 protein function is unknown (PubMed, Aug 2019).", "Associated with drug Resistance": ""}, "IKZF1": {"Variant": "H508R", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "IKZF1 H508R does not lie within any known functional domains of the Ikzf1 protein (UniProt.org). H508R has not been characterized in the scientific literature and therefore, its effect on Ikzf1 protein function is unknown (PubMed, Sep 2018).", "Associated with drug Resistance": ""}, "JAK2": {"Variant": "ETV6 - JAK2", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "ETV6-JAK2 results from the fusion of ETV6 (also referred to as TEL) and JAK2 (PMID: 9736611). ETV6-JAK2 results in growth factor independence, constitutive kinase activity and increased downstream signaling (PMID: 9736611).", "Associated with drug Resistance": ""}, "JAK3": {"Variant": "ETV6 - JAK3", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "ETV6-JAK3 results from the fusion of ETV6 and JAK3, which leads to constitutive activation of Stat1 and Stat3, increased expression of Stat5 target genes, and is transforming in cell culture (PMID: 10706877).", "Associated with drug Resistance": ""}, "KDM6A": {"Variant": "loss", "Imapct": "unknown", "Protein Effect": "loss of function", "Variant Description": "KDM6A loss indicates loss of the KDM6A gene, mRNA, and protein.", "Associated with drug Resistance": ""}, "KDR": {"Variant": "R1032Q", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "KDR (VEGFR2) R1032Q lies within the protein kinase domain of the Kdr (Vegfr2) protein (UniProt.org). R1032Q results in decreased ligand-induced phosphorylation of Kdr (Vegfr2) and Mapk in cell culture (PMID: 28743916), but induces tumor growth in animal models above wild-type protein (PMID: 29588308), and therefore, its effect on Kdr (Vegfr2) protein function is unknown.", "Associated with drug Resistance": ""}, "KIT": {"Variant": "N564_L576del", "Imapct": "deletion", "Protein Effect": "gain of function - predicted", "Variant Description": "KIT N564_L576del results in the deletion of thirteen amino acids in the juxtamembrane domain (exon 11) of the Kit protein from amino acids 564 to 576 (PMID: 12879016). N564_L576del has not been characterized, however similar Kit exon 11 deletions are activating, thus N564_L576del is predicted to lead to a gain of Kit protein function (PMID: 9438854, PMID: 15365079).", "Associated with drug Resistance": ""}, "KMT2A": {"Variant": "K1457N", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "KMT2A K1457N lies within the PHD-type zinc finger domain 1 of the Kmt2a protein (UniProt.org). K1457N has not been characterized in the scientific literature and therefore, its effect on Kmt2a protein function is unknown (PubMed, Jul 2019).", "Associated with drug Resistance": ""}, "MAP2K1": {"Variant": "S123T", "Imapct": "missense", "Protein Effect": "gain of function", "Variant Description": "MAP2K1 S123T lies within the protein kinase domain of the Map2k1 protein (UniProt.org). S123T confers a gain of function to the Map2k1 protein as demonstrated by increased Mek and Erk phosphorylation relative to wild-type Map2k1 (PMID: 26566875).", "Associated with drug Resistance": ""}, "MET": {"Variant": "N38K", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "MET N38K lies within the Sema domain of the Met protein (UniProt.org). N38K has not been characterized in the scientific literature and therefore, its effect on Met protein function is unknown (PubMed, Aug 2019).", "Associated with drug Resistance": ""}, "MLH1": {"Variant": "L550I", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "MLH1 L550I lies within the EXO1-interacting region of the Mlh1 protein (PMID: 22753075). L550I has not been characterized in the scientific literature and therefore, its effect on Mlh1 protein function is unknown (PubMed, Sep 2019).", "Associated with drug Resistance": ""}, "MPL": {"Variant": "W515A", "Imapct": "missense", "Protein Effect": "gain of function", "Variant Description": "MPL W515A lies within the cytoplasmic domain of the Mpl protein (UniProt.org). W515A confers a gain of function to Mpl protein as indicated by ligand-independent activation of Jak-Stat signaling in cell culture (PMID: 26437785) and induces ligand-independent cell proliferation in cell culture (PMID: 19996410).", "Associated with drug Resistance": ""}, "MSH6": {"Variant": "A25S", "Imapct": "missense", "Protein Effect": "no effect", "Variant Description": "MSH6 A25S does not lie within any known functional domains of the Msh6 protein (UniProt.org). A25S demonstrates proficient mismatch repair activity in an in vitro assay (PMID: 22102614, and was not identified to interfere with Msh6 mismatch repair activity in a functional screen (PMID: 28531214).", "Associated with drug Resistance": ""}, "MYD88": {"Variant": "P245S", "Imapct": "missense", "Protein Effect": "loss of function - predicted", "Variant Description": "MYD88 P245S lies within the TIR domain of the Myd88 protein (UniProt.org). P245S is predicted to confer a loss of function to the Myd88 protein as demonstrated by loss of binding to Mal in cell culture (PMID: 26876098).", "Associated with drug Resistance": ""}, "NOTCH1": {"Variant": "Y577H", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "NOTCH1 Y577H lies within the calcium-binding EGF-like domain 15 of the Notch1 protein (UniProt.org). Y577H has not been characterized in the scientific literature and therefore, its effect on Notch1 protein function is unknown (PubMed, Aug 2019).", "Associated with drug Resistance": ""}, "NPM1": {"Variant": "L287fs", "Imapct": "frameshift", "Protein Effect": "unknown", "Variant Description": "NPM1 L287fs results in a change in the amino acid sequence of the Npm1 protein beginning at aa 287 of 294, likely resulting in premature truncation of the functional protein (UniProt.org). L287fs has been identified in the scientific literature (PMID: 29705980, PMID: 31048683), but has not been biochemically characterized and therefore, its effect on Npm1 protein function is unknown (PubMed, Oct 2019).", "Associated with drug Resistance": ""}, "NRAS": {"Variant": "R167L", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "NRAS R167L lies within the hypervariable region of the Nras protein (UniProt.org). R167L has been identified in the scientific literature (PMID: 26343583), but has not been biochemically characterized and therefore, its effect on Nras protein function is unknown (PubMed, Oct 2019).", "Associated with drug Resistance": ""}, "PDGFRA": {"Variant": "ETV6 - PDGFRA", "Imapct": "fusion", "Protein Effect": "gain of function - predicted", "Variant Description": "ETV6-PDGFRA results from the fusion of ETV6 and PDGFRA (PMID: 17555450). ETV6-PDGFRA is responsive to Pdgfra inhibition and therefore, the fusion is predicted to result in a gain of function (PMID: 17555450).", "Associated with drug Resistance": ""}, "PHF6": {"Variant": "E117D", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "PHF6 E117D lies within the extended PHD1 domain of the Phf6 protein (UniProt.org). E117D has not been characterized in the scientific literature and therefore, its effect on Phf6 protein function is unknown (PubMed, Sep 2018).", "Associated with drug Resistance": ""}, "PIK3CA": {"Variant": "E80K", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "PIK3CA E80K lies within the PI3K-ABD domain of the Pik3ca protein (UniProt.org). E80K has been identified in the scientific literature (PMID: 29636477, PMID: 22722201), but has not been biochemically characterized and therefore, its effect on Pik3ca protein function is unknown (PubMed, Aug 2019).", "Associated with drug Resistance": ""}, "PTEN": {"Variant": "T319fs", "Imapct": "frameshift", "Protein Effect": "loss of function - predicted", "Variant Description": "PTEN T319fs results in a change in the amino acid sequence of the Pten protein beginning at aa 319 of 403, likely resulting in premature truncation of the functional protein (UniProt.org). T319fs has not been characterized, however other C-terminal deletion mutants downstream of T319 are inactivating (PMID: 10468583), thus T319fs is predicted to lead to a loss of Pten protein function.", "Associated with drug Resistance": ""}, "PTPN11": {"Variant": "L117F", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "PTPN11 L117F lies within the SH2 domain 2 of the Ptpn11 protein (UniProt.org). L117F has not been characterized in the scientific literature and therefore, its effect on Ptpn11 protein function is unknown (PubMed, Jun 2019).", "Associated with drug Resistance": ""}, "RAD21": {"Variant": "E495D", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "RAD21 E495D does not lie within any known functional domains of the Rad21 protein (UniProt.org). E495D has not been characterized in the scientific literature and therefore, its effect on Rad21 protein function is unknown (PubMed, Aug 2019).", "Associated with drug Resistance": ""}, "RB1": {"Variant": "E48*", "Imapct": "nonsense", "Protein Effect": "loss of function - predicted", "Variant Description": "RB1 E48* results in a premature truncation of the Rb1 protein at amino acid 48 of 928 (UniProt.org). Due to the loss of all known functional domains (UniProt.org), E48* is predicted to lead to a loss of Rb1 protein function.", "Associated with drug Resistance": ""}, "RET": {"Variant": "A883X", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "RET A883X indicates any Ret missense mutation that results in replacement of the alanine (A) at amino acid 883 by a different amino acid.", "Associated with drug Resistance": ""}, "ROS1": {"Variant": "ETV6 - ROS1", "Imapct": "fusion", "Protein Effect": "gain of function - predicted", "Variant Description": "ETV6-ROS1 results from the fusion of ETV6 and ROS1, and leads to constitutive ROS1 activation in cultured cells (PMID: 26939704) and therefore, is predicted to confer a gain of function.", "Associated with drug Resistance": ""}, "RUNX1": {"Variant": "ETV6 - RUNX1", "Imapct": "fusion", "Protein Effect": "gain of function", "Variant Description": "ETV6-RUNX1 results from the fusion of ETV6 and RUNX1, which leads to altered transcriptional regulation resulting in preleukemic cells (PMID: 17325341) and demonstrates upregulation of EPOR, leading to increased cell survival (PMID: 21900195).", "Associated with drug Resistance": ""}, "SETBP1": {"Variant": "T195M", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "SETBP1 T195M does not lie within any known functional domains of the Setbp1 protein (PMID: 23222956). T195M has not been characterized in the scientific literature and therefore, its effect on Setbp1 protein function is unknown (PubMed, Sep 2018).", "Associated with drug Resistance": ""}, "SF3B1": {"Variant": "R568C", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "SF3B1 R568C lies within the HEAT repeat 1 and SF3B14-interacting region of the Sf3b1 protein (UniProt.org). R568C has been identified in sequencing studies (PMID: 22895193), but has not been biochemically characterized and therefore, its effect on Sf3b1 protein function is unknown (PubMed, Jul 2019).", "Associated with drug Resistance": ""}, "SMAD4": {"Variant": "Y322*", "Imapct": "nonsense", "Protein Effect": "loss of function - predicted", "Variant Description": "SMAD4 Y322* results in a premature truncation of the Smad4 protein at amino acid 322 of 552 (UniProt.org). Y322* has not been characterized however, due to the effects of other truncation mutations downstream of Y322 (PMID: 11553622, PMID: 22316667), Y322* is predicted to lead to a loss of Smad4 protein function.", "Associated with drug Resistance": ""}, "SMARCB1": {"Variant": "positive", "Imapct": "unknown", "Protein Effect": "unknown", "Variant Description": "SMARCB1 positive indicates the presence of the SMARCB1 gene, mRNA, and/or protein.", "Associated with drug Resistance": ""}, "SMC3": {"Variant": "Y979C", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "SMC3 Y979C lies within the coiled-coil domain of the Smc3 protein (UniProt.org). Y979C has not been characterized in the scientific literature and therefore, its effect on Smc3 protein function is unknown (PubMed, Aug 2019).", "Associated with drug Resistance": ""}, "SMO": {"Variant": "T349I", "Imapct": "missense", "Protein Effect": "no effect - predicted", "Variant Description": "SMO T349I lies within a cytoplasmic domain of the Smo protein (UniProt.org). T349I results in similar Hedgehog pathway signaling to wild-type Smo in the absence or presence of ligand in culture (PMID: 25801792), and therefore, is predicted to have no effect on Smo protein function.", "Associated with drug Resistance": ""}, "SRC": {"Variant": "L320I", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "SRC L320I lies within the protein kinase domain of the Src protein (UniProt.org). L320I demonstrates a similar kinase domain conformation to wild-type Src (PMID: 31287657), but has not been fully biochemically characterized and therefore, its effect on Src protein function is unknown.", "Associated with drug Resistance": ""}, "SRSF2": {"Variant": "S171Y", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "SRSF2 S171Y lies within the RS domain of the Srsf2 protein (UniProt.org). S171Y has been identified in sequencing studies (PMID: 25401301), but has not been biochemically characterized and therefore, its effect on Srsf2 protein function is unknown (PubMed, Jul 2019).", "Associated with drug Resistance": ""}, "STAG2": {"Variant": "Q185H", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "STAG2 Q185H does not lie within any known functional domains of the Stag2 protein (UniProt.org). Q185H has not been characterized in the scientific literature and therefore, its effect on Stag2 protein function is unknown (PubMed, Sep 2019).", "Associated with drug Resistance": ""}, "STK11": {"Variant": "E165*", "Imapct": "nonsense", "Protein Effect": "loss of function - predicted", "Variant Description": "STK11 E165* results in a premature truncation of the Stk11 protein at amino acid 165 of 433 (UniProt.org). E165* has not been characterized, however, due to the effects of truncation mutations downstream of E165 (PMID: 23612973), E165* is predicted to lead to a loss of Stk11 protein function.", "Associated with drug Resistance": ""}, "TET2": {"Variant": "H924R", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "TET2 H924R does not lie within any known functional domains of the Tet2 protein (UniProt.org). H924R has been identified in sequencing studies (PMID: 26984174), but has not been biochemically characterized and therefore, its effect on Tet2 protein function is unknown (PubMed, Sep 2019).", "Associated with drug Resistance": ""}, "TP53": {"Variant": "E298V", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "TP53 E298V lies within the DNA-binding domain of the Tp53 protein (PMID: 22713868). E298V has been identified in sequencing studies (PMID: 26205736), but has not been biochemically characterized and therefore, its effect on Tp53 protein function is unknown (PubMed, Oct 2019).", "Associated with drug Resistance": ""}, "U2AF1": {"Variant": "K191N", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "U2AF1 K191N lies within the RS domain of the U2af1 protein (UniProt.org). K191N has been identified in sequencing studies (PMID: 22622578), but has not been biochemically characterized and therefore, its effect on U2af1 protein function is unknown (PubMed, Sep 2019).", "Associated with drug Resistance": ""}, "VHL": {"Variant": "S38F", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "VHL S38F lies within the pentameric repeat region of the Vhl protein (UniProt.org). S38F has been identified in sequencing studies (PMID: 15932632), but has not been biochemically characterized and therefore, its effect on Vhl protein function is unknown (PubMed, Oct 2019)", "Associated with drug Resistance": ""}, "ZRSR2": {"Variant": "S276L", "Imapct": "missense", "Protein Effect": "unknown", "Variant Description": "ZRSR2 S276L lies within the RRM domain of the Zrsr2 protein (UniProt.org). S276L has not been characterized and therefore, its effect on Zrsr2 protein function is unknown (PubMed, Aug 2019).", "Associated with drug Resistance": ""}}